# Parameter Type Id Rebar Crank Ratio Property

Source: https://www.revitapidocs.com/2026/54b55d5d-d929-df7a-4914-031a3bc92159.htm

---

| Parameter Type Id Rebar Crank Ratio Property |
| --- |

"Crank Slope 1:"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarCrankRatio { get; }
```

```
Public Shared ReadOnly Property RebarCrankRatio As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarCrankRatio {
	ForgeTypeId^ get ();
}
```

```
static member RebarCrankRatio : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace